Revit 2024 API
ForgeTypeId.GetHashCode Method
 Returns the hash code for this ForgeTypeId
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2021
Syntax
C#
public override int GetHashCode()
Visual Basic
Public Overrides Function GetHashCode As Integer
Visual C++
public:
virtual int GetHashCode() override
Return Value
 A 32-bit signed integer hash code.
See Also
ForgeTypeId Class
Autodesk.Revit.DB Namespace